{
  "chapters": [
    {
      "chapter": 1,
      "title": "Childhood and Early Life",
      "story": "José Rizal grew up in a small, peaceful town called Calamba.\nHe loved reading books, drawing pictures, and learning new things.\nHis parents taught him good manners and to be kind to everyone.\nRizal was curious about the world and asked many questions.\nHis family supported him and helped him grow into a smart young boy.\nThese early years shaped the hero he would become."
    },
    {
      "chapter": 2,
      "title": "Student Years",
      "story": "Rizal studied in different schools to improve himself.\nHe was shy at first, but he worked hard in his lessons.\nHe learned Spanish, science, math, and many other subjects.\nTeachers respected him because he was disciplined and polite.\nHe also discovered his passion for writing and art.\nRizal's school life prepared him for bigger challenges ahead."
    },
    {
      "chapter": 3,
      "title": "Travel and Exposure",
      "story": "As Rizal grew older, he traveled to other countries.\nHe saw new cultures and met people from around the world.\nHe learned how other nations lived freely and peacefully.\nThese travels opened his eyes to the problems in the Philippines.\nRizal realized that Filipinos deserved the same fairness and respect.\nHis journeys helped him understand how to help his country."
    },
    {
      "chapter": 4,
      "title": "Literary Works",
      "story": "Rizal loved writing stories and poems.\nHe used his words to show what Filipinos were feeling.\nHis books, like *Noli Me Tangere* and *El Filibusterismo*, opened people’s eyes.\nThey talked about injustices and unfair treatment.\nMany Filipinos were inspired to stand up for what is right.\nRizal used writing, not violence, to share his message."
    },
    {
      "chapter": 5,
      "title": "Advocacy and Reform",
      "story": "Rizal wanted peaceful change for the Philippines.\nHe believed that education was the key to freedom.\nHe wrote letters, essays, and articles calling for fair treatment.\nHe encouraged Filipinos to be brave and united.\nRizal hoped the government would listen and make good changes.\nHis ideas helped Filipinos believe in a better future."
    },
    {
      "chapter": 6,
      "title": "Return to the Philippines",
      "story": "Even though it was dangerous, Rizal returned home.\nHe wanted to help his people improve their lives.\nHe opened a school in Dapitan and taught children many skills.\nRizal also worked as a doctor and helped the sick.\nHe planted trees, built projects, and made the community better.\nPeople admired him for his kindness and dedication."
    },
    {
      "chapter": 7,
      "title": "Trial and Imprisonment",
      "story": "Because of his writings and beliefs, Rizal was arrested.\nHe was accused of causing trouble even though he wanted peace.\nInside the jail, he stayed calm and continued writing.\nRizal showed courage even during difficult days.\nHe wrote a poem called *Mi Último Adiós* filled with love for his country.\nHe accepted his fate with bravery and hope."
    },
    {
      "chapter": 8,
      "title": "Execution and Legacy",
      "story": "On December 30, 1896, Rizal was executed.\nMany Filipinos cried, but they also felt inspired.\nRizal’s death awakened the spirit of the nation.\nPeople remembered his courage, kindness, and dreams for freedom.\nHis ideas helped lead the Philippines toward independence.\nToday, Rizal is honored as a national hero whose story continues to guide children and adults."
    }
  ]
}
